#include <iostream>
#include <cstdio>

class list {
    public:
           list   ();              /* κατασκευαστής:  κατασκευάζει μία κενή λίστα */
      bool empty  ();              /* ελέγχει αν η λίστα είναι κενή */
      int  size   ();              /* επιστρέφει το μέγεθος της λίστας */
      void add    (int k, int x);  /* εισάγει το στοιχείο x στη θέση k της λίστας */
      int  get    (int k);         /* επιστρέφει την τιμή του στοιχείου στη θέση k της λίστας */
      void remove (int k);         /* διαγράφει το στοιχείο στη θέση k της λίστας */
    };